test_ab/test_ab_n10000_c100.txt
================= Mem Java =================
  RSS
244788

================= Threads =================
Total live threads: 19

================= Test AB =================
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 3.19.217.251 (be patient)


Server Software:        
Server Hostname:        3.19.217.251
Server Port:            8080

Document Path:          /api/auth
Document Length:        24 bytes

Concurrency Level:      100
Time taken for tests:   18.041 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      1030000 bytes
HTML transferred:       240000 bytes
Requests per second:    554.29 [#/sec] (mean)
Time per request:       180.411 [ms] (mean)
Time per request:       1.804 [ms] (mean, across all concurrent requests)
Transfer rate:          55.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   12   7.3     12      38
Processing:    17  167  20.5    166     235
Waiting:       13  167  20.5    165     235
Total:         17  180  23.5    181     253

Percentage of the requests served within a certain time (ms)
  50%    181
  66%    189
  75%    194
  80%    197
  90%    205
  95%    217
  98%    232
  99%    236
 100%    253 (longest request)

================= Threads =================
Total live threads: 19

================= Mem Java =================
  RSS
247476